{
    "minifier_tools": {
        "name": "Minifier Tools",
        "synopsis": "Utilitaire de minification de fichiers",
        "description": "Minifier Tools est un utilitaire conçu pour faciliter la minification de fichiers, offrant une solution rapide et efficace pour réduire leur taille sans effort. Que ce soit pour améliorer les performances d'un site web, optimiser l'utilisation de la bande passante ou automatiser un processus de build, cet outil s'adapte à différents besoins. Il propose deux modes d'utilisation : un minificateur post-build qui s'intègre directement dans le processus de compilation et un minificateur autonome permettant de traiter manuellement des fichiers en les déposant dans un dossier dédié. Compatible avec plusieurs types de fichiers comme JavaScript, CSS, JSON, HTML et SVG, Minifier Tools assure une prise en charge fluide des dépendances en vérifiant et installant automatiquement les outils nécessaires. Son fonctionnement intuitif permet de minifier des fichiers sans risque d'écrasement, en générant des versions optimisées avec un suffixe distinct. Grâce à son approche flexible et automatisée, Minifier Tools est un allié idéal pour tout développeur souhaitant simplifier la gestion de la minification et améliorer la performance de ses projets.",
        "date": "25/12/2024",
        "link": "https://github.com/BreadyBred/minifier-tools/",
        "image_url": "minifier_tools",
        "thumbnail_url": "minifier_tools",
        "important_techs": [
            "Python",
            "Shell",
            "NodeJS"
        ],
        "tech_used": [
            "Python",
            "Shell",
            "NodeJS"
        ],
        "to_show": true
    },
    "codewars_rank_fetcher": {
        "name": "Codewars Rank Fetcher",
        "synopsis": "Application de bureau",
        "description": "Codewars Rank Fetcher est une application de bureau conçue pour automatiser la récupération et le stockage de vos classements Codewars. Grâce à une interface intuitive, elle permet aux utilisateurs de suivre leur progression en récupérant leurs rangs directement depuis l'API de Codewars. L'application offre une personnalisation avancée, permettant de spécifier un nom d'utilisateur, de sélectionner les catégories à suivre et d'ordonner les classements du plus haut au plus bas. Les données sont stockées au format JSON, facilitant leur intégration dans un portfolio, un CV ou un site personnel. Facile à utiliser, il suffit d'entrer son nom d'utilisateur, de choisir ses préférences et de lancer la récupération des classements. Une fois le processus terminé, les résultats sont accessibles sous forme de fichier structuré, prêt à être consulté ou réutilisé. Que ce soit pour préparer un entretien, suivre ses progrès ou mettre en valeur ses compétences, Codewars Rank Fetcher simplifie la gestion des classements en offrant une solution rapide et efficace pour centraliser ses performances en programmation.",
        "date": "19/01/2025",
        "link": "https://github.com/BreadyBred/codewars-rank-fetcher/",
        "image_url": "codewars_rank_fetcher",
        "thumbnail_url": "codewars_rank_fetcher",
        "important_techs": [
            "Python",
            "threading",
            "tkinter"
        ],
        "tech_used": [
            "API",
            "Python",
            "threading",
            "tkinter"
        ],
        "to_show": true
    },
    "codewars": {
        "name": "Codewars",
        "synopsis": "Exercices de programmation",
        "description": "Dans ce dépôt GitHub, je partage mes solutions aux exercices proposés par CodeWars, une plateforme reconnue pour ses défis de programmation variés et stimulants. Mes solutions sont principalement écrites en PHP et JavaScript, deux langages que j'apprécie particulièrement, avec quelques incursions en Python pour diversifier mes compétences. Plus qu'un simple recueil de code, ce dépôt témoigne de mon évolution en tant que développeur, animé par la volonté d'apprendre, de relever des défis et d'améliorer continuellement mes connaissances. Que vous souhaitiez découvrir mes solutions ou envisager une collaboration, ce dépôt vous offre un aperçu de mon univers de programmation.",
        "date": "18/03/2024",
        "link": "https://github.com/BreadyBred/codewars",
        "image_url": "codewars",
        "thumbnail_url": "codewars",
        "important_techs": [
            "JavaScript",
            "PHP"
        ],
        "tech_used": [
            "JavaScript",
            "PHP",
            "Python"
        ],
        "to_show": true
    },
    "pokegen": {
        "name": "PokeGen",
        "synopsis": "Pokémon Showdown Randomizer",
        "description": "« PokeGen » est un générateur d'équipes Pokémon aléatoires conçu pour les joueurs de Pokémon Showdown. Lassé(e) de composer des équipes classiques ? Ce site web vous propose une expérience rafraîchissante en générant une équipe de six Pokémon de manière aléatoire. Chaque Pokémon est présenté avec sa carte détaillée : nom, sprite, types, numéro de Pokédex et statistiques. Vous pouvez relancer la génération d'équipe complète avec le bouton « Generate » ou cibler un seul Pokémon de votre équipe pour le remplacer. Un sélecteur de génération permet également de personnaliser davantage la génération aléatoire. Idéal pour des combats amicaux et pour découvrir des synergies inattendues !",
        "date": "16/09/2024",
        "link": "https://pokegen.42web.io/",
        "image_url": "pokegen",
        "thumbnail_url": "pokegen",
        "important_techs": [
            "LESS",
            "JavaScript"
        ],
        "tech_used": [
            "HTML5",
            "LESS",
            "JavaScript",
            "API"
        ],
        "to_show": true
    },
    "la_reconquete": {
        "name": "La Reconquête",
        "synopsis": "Projet Universitaire de 1ère année",
        "description": "« La Reconquête » est un projet ambitieux mené lors de ma première année de DUT, constituant une première expérience concrète dans le développement web. Ce projet m'a permis d'acquérir des compétences en conception de sites web interactifs, en création de supports visuels et en gestion de projet. Il comprend la réalisation d'un site web immersif sur l'époque médiévale, ainsi que la conception de visuels pour la promotion de l'événement.",
        "date": "10/07/2020",
        "link": "https://lareconquete.42web.io",
        "image_url": "la_reconquete",
        "thumbnail_url": "la_reconquete",
        "important_techs": [
            "Figma",
            "JavaScript"
        ],
        "tech_used": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "Figma"
        ],
        "to_show": true
    },
    "stardew_dashboard": {
        "name": "Stardew Dashboard",
        "synopsis": "WebApp pour Stardew Valley",
        "description": "« Stardew Dashboard » est le compagnon ultime des fermiers dévoués de Stardew Valley. Téléchargez facilement votre fichier de sauvegarde de jeu et accédez à une multitude d'informations sur votre ferme. De la maîtrise des recettes à la découverte de nouveaux éléments de jeu, notre interface intuitive vous aide à répondre aux besoins de votre ferme et à explorer tout ce que Stardew Valley a à offrir.",
        "date": "10/06/2024",
        "link": "https://stardew-dashboard.42web.io/",
        "image_url": "stardew_dashboard",
        "thumbnail_url": "stardew_dashboard",
        "important_techs": [
            "LESS",
            "PHP",
            "Typescript"
        ],
        "tech_used": [
            "HTML5",
            "LESS",
            "PHP",
            "JSON",
            "Figma",
            "Typescript"
        ],
        "to_show": true
    },
    "maichef": {
        "name": "MaïChef",
        "synopsis": "Maquettage d'une application",
        "description": "« Maïchef » est le fruit d'un projet passionnant mené lors d'un Hackathon ! En équipe, nous avons développé cette application de cuisine personnalisée, permettant aux utilisateurs de créer des plats uniques avec leurs ingrédients. Ce Hackathon a été une expérience formatrice intense, nous permettant de mettre en pratique nos compétences en conception, développement et gestion de projet.",
        "date": "17/11/2023",
        "link": "https://maichef.42web.io",
        "image_url": "maichef",
        "thumbnail_url": "maichef",
        "important_techs": [
            "Figma"
        ],
        "tech_used": [
            "HTML5",
            "CSS3",
            "Figma"
        ],
        "to_show": true
    },
    "monarchy_mayhem": {
        "name": "Monarchy Mayhem",
        "synopsis": "Création d'un jeu vidéo",
        "description": "« Monarchy Mayhem » est un jeu vidéo que nous avons développé en équipe au cours de notre troisième année de BUT. À partir de zéro, nous avons conçu le jeu en utilisant Unity et le langage C#, développé le site web en PHP, et orchestré une campagne de communication à 360 degrés pour promouvoir l'ensemble du projet. Ce fut un succès total et le jeu est actuellement disponible sur Itch.io.",
        "date": "20/02/2024",
        "link": "https://monarchymayhem.top",
        "image_url": "monarchy_mayhem",
        "thumbnail_url": "monarchy_mayhem",
        "important_techs": [
            "PHP",
            "C#"
        ],
        "tech_used": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "PHP",
            "MySQL",
            "JSON",
            "C#"
        ],
        "to_show": true
    }
}